# BooleanOperationsUtils Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BooleanOperationsUtils Properties
BooleanOperationsUtils Class See Also
---
The BooleanOperationsUtils type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace